---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
source: html/a7b5b7de-dfdb-e57f-7fac-1ff1dbf35e4d.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport

Represents a report instance of the systems analysis.

## Syntax (C#)
```csharp
public class ViewSystemsAnalysisReport : View
```